
[info]
drivername=UGTHRSVC
symbolfile=GthrCtr.h

[languages]
804=Chinese (PRC)

[text]
OBJECT_GTHRSVC_804_NAME=Search Gatherer
OBJECT_GTHRSVC_804_HELP=Windows Search Service Gathering 服务对象计数器
COUNTER_GTHRSVC_NOTIFICATION_SOURCES_804_NAME=Notification Sources
COUNTER_GTHRSVC_NOTIFICATION_SOURCES_804_HELP=当前已连接的外部通知源。
COUNTER_GTHRSVC_EXTNOTIFICATIONS_RECEIVED_804_NAME=Ext. Notifications Received
COUNTER_GTHRSVC_EXTNOTIFICATIONS_RECEIVED_804_HELP=从所有通知源(不包括文件系统)收到的通知总数。
COUNTER_GTHRSVC_EXTNOTIFICATIONS_RECEIVED_PER_SEC_804_NAME=Ext. Notifications Rate
COUNTER_GTHRSVC_EXTNOTIFICATIONS_RECEIVED_PER_SEC_804_HELP=每秒钟接收外部通知的速度。
COUNTER_GTHRSVC_ADMIN_SOURCES_804_NAME=Admin Clients
COUNTER_GTHRSVC_ADMIN_SOURCES_804_HELP=当前连接的管理客户端数。
COUNTER_GTHRSVC_HEARTBEATS_804_NAME=Heartbeats
COUNTER_GTHRSVC_HEARTBEATS_804_HELP=启动后开始计数的心跳总数。服务运行时每 10 秒钟发生一次心跳。如果服务不在运行，将没有心跳并且记号数不会增加。
COUNTER_GTHRSVC_HEARTBEATS_PER_SEC_804_NAME=Heartbeats Rate
COUNTER_GTHRSVC_HEARTBEATS_PER_SEC_804_HELP=每 10 秒钟显示一次心跳。
COUNTER_GTHRSVC_ROBOT_THREADS_804_NAME=Filtering Threads
COUNTER_GTHRSVC_ROBOT_THREADS_804_HELP=系统钟筛选线程的总数。该数基于你的系统资源计数。
COUNTER_GTHRSVC_IDLE_THREADS_804_NAME=Idle Threads
COUNTER_GTHRSVC_IDLE_THREADS_804_HELP=等待文档的线程数。
COUNTER_GTHRSVC_TRANSACTIONS_CACHED_804_NAME=Document Entries
COUNTER_GTHRSVC_TRANSACTIONS_CACHED_804_HELP=当前内存中文档数。0 表示没有索引活动。
COUNTER_GTHRSVC_PERFORMANCE_LEVEL_804_NAME=Performance Level
COUNTER_GTHRSVC_PERFORMANCE_LEVEL_804_HELP=表示 Gatherer 服务允许使用的系统资源数量的级别。
COUNTER_GTHRSVC_QUEUE_LENGTH_804_NAME=Active Queue Length
COUNTER_GTHRSVC_QUEUE_LENGTH_804_HELP=等待机器人线程的文档数。如果不是 0， 所有线程必须被筛选。
COUNTER_GTHRSVC_FILTER_PROCESSES_804_NAME=Filter Processes
COUNTER_GTHRSVC_FILTER_PROCESSES_804_HELP=系统中筛选进程数。
COUNTER_GTHRSVC_FILTER_PROCESSES_MAX_804_NAME=Filter Processes Max
COUNTER_GTHRSVC_FILTER_PROCESSES_MAX_804_HELP=启动后系统中存在的筛选进程的最大数。
COUNTER_GTHRSVC_FILTER_PROCESS_CREATED_804_NAME=Filter Process Created
COUNTER_GTHRSVC_FILTER_PROCESS_CREATED_804_HELP=筛选进程创建或重新启动的总次数。太多的筛选进程说明筛选处理文档中的数据有问题。
COUNTER_GTHRSVC_TRANSACTIONS_DELAYED_804_NAME=Delayed Documents
COUNTER_GTHRSVC_TRANSACTIONS_DELAYED_804_HELP=由于网站点击频率规则而延迟的文档数。
COUNTER_GTHRSVC_SERVER_OBJECTS_804_NAME=Server Objects
COUNTER_GTHRSVC_SERVER_OBJECTS_804_HELP=最近系统访问的服务器数。
COUNTER_GTHRSVC_SERVER_OBJECTS_CREATED_804_NAME=Server Objects Created
COUNTER_GTHRSVC_SERVER_OBJECTS_CREATED_804_HELP=新的服务器对象被创建的次数。
COUNTER_GTHRSVC_FILTER_OBJECTS_804_NAME=Filter Objects
COUNTER_GTHRSVC_FILTER_OBJECTS_804_HELP=系统中的筛选对象数。每个筛选对象与当前被筛选的 URL 相关。
COUNTER_GTHRSVC_DOCUMENTS_FILTERED_804_NAME=Documents Filtered
COUNTER_GTHRSVC_DOCUMENTS_FILTERED_804_HELP=筛选对象创建的次数。它与启动后系统筛选的文档总数相关。
COUNTER_GTHRSVC_DOCUMENTS_FILTERED_PER_SEC_804_NAME=Documents Filtered Rate
COUNTER_GTHRSVC_DOCUMENTS_FILTERED_PER_SEC_804_HELP=每秒钟筛选的文档数。
COUNTER_GTHRSVC_TIMEOUTS_804_NAME=Time Outs
COUNTER_GTHRSVC_TIMEOUTS_804_HELP=启动后系统检测到的超时总数。
COUNTER_GTHRSVC_SERVERS_CURRENTLY_UNAVAILABLE_804_NAME=Servers Currently Unavailable
COUNTER_GTHRSVC_SERVERS_CURRENTLY_UNAVAILABLE_804_HELP=当对服务器的请求超时到达一定数量时，该服务器不可用。
COUNTER_GTHRSVC_SERVERS_UNAVAILABLE_804_NAME=Servers Unavailable
COUNTER_GTHRSVC_SERVERS_UNAVAILABLE_804_HELP=当对服务器的请求超时到达一定数量时，该服务器不可用。
COUNTER_GTHRSVC_THREADS_ACCESSING_NETWORK_804_NAME=Threads Accessing Network
COUNTER_GTHRSVC_THREADS_ACCESSING_NETWORK_804_HELP=等待筛选进程响应的线程数。如果没有活动并且该数等于筛选线程数，这可能表示网络问题或正在爬网的服务器不可用。
COUNTER_GTHRSVC_THREADS_IN_PLUGINS_804_NAME=Threads In Plug-ins
COUNTER_GTHRSVC_THREADS_IN_PLUGINS_804_HELP=等待插件完成操作的线程数。
COUNTER_GTHRSVC_FILTERED_SUCCESS_804_NAME=Documents Successfully Filtered
COUNTER_GTHRSVC_FILTERED_SUCCESS_804_HELP=成功筛选的文档数。
COUNTER_GTHRSVC_FILTERED_SUCCESS_PER_SEC_804_NAME=Documents Successfully Filtered Rate
COUNTER_GTHRSVC_FILTERED_SUCCESS_PER_SEC_804_HELP=每秒钟成功筛选的文档数。
COUNTER_GTHRSVC_TRANSACTIONS_DELAYED_RETRY_804_NAME=Documents Delayed Retry
COUNTER_GTHRSVC_TRANSACTIONS_DELAYED_RETRY_804_HELP=超时后将重试的文档数。如果为非 0，这表示正在爬网的本地服务器已关闭。
COUNTER_GTHRSVC_CACHED_WORD_BREAKERS_804_NAME=Word Breakers Cached
COUNTER_GTHRSVC_CACHED_WORD_BREAKERS_804_HELP=可用的缓存分词系统实例数。
COUNTER_GTHRSVC_CACHED_STEMMERS_804_NAME=Stemmers Cached
COUNTER_GTHRSVC_CACHED_STEMMERS_804_HELP=可用的缓存 stemmer 实例数。太多实例可能说明资源使用问题。
COUNTER_GTHRSVC_TOTALNOTIFICATIONS_RECEIVED_804_NAME=All Notifications Received
COUNTER_GTHRSVC_TOTALNOTIFICATIONS_RECEIVED_804_HELP=从所有通知源(包括文件系统)收到的通知总数。
COUNTER_GTHRSVC_TOTALNOTIFICATIONS_RECEIVED_PER_SEC_804_NAME=Notifications Rate
COUNTER_GTHRSVC_TOTALNOTIFICATIONS_RECEIVED_PER_SEC_804_HELP=每秒钟接收外部通知的速度。
COUNTER_GTHRSVC_IORATE_DETECTED_804_NAME=System IO traffic rate
COUNTER_GTHRSVC_IORATE_DETECTED_804_HELP=后退逻辑检测到的系统 IO(磁盘)流速(以 KB/s 为单位)
COUNTER_GTHRSVC_BACKOFF_REASON_804_NAME=Reason to back off
COUNTER_GTHRSVC_BACKOFF_REASON_804_HELP=代码描述 Gatherer 服务进入后退状态的原因。0 - 启动并在运行 1 - 高系统 IO 流量 2 - 高通知速度 3 - 正在进行的延迟的恢复(未实现) 4 - 由于用户活动而后退 5 - 电池低 6 - 内存低 99 - 由于内部原因而后退(由于 Search 本身) 当后退时，不执行索引。要恢复索引，你必须消除后退的原因。如果 Gatherer 服务在后退状态，搜索服务将暂停，并且事件日志中显示消息。
COUNTER_GTHRSVC_THREADS_BLOCKED_ON_BACKOFF_804_NAME=Threads blocked due to back off
COUNTER_GTHRSVC_THREADS_BLOCKED_ON_BACKOFF_804_HELP=由于后退事件阻止的线程数。
